DataProcessors/бит_Битфон.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<DataProcessor>
		<Properties>
			<Name>бит_Битфон</Name>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ИсторияЗвонковВходящие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗвонка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипЗвонка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успешность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗвонка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьРазговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводДата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>НабранныйНомер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>50</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводДлительностьЗвонка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ИсторияЗвонковИсходящие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Абонент</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КонтактноеЛицо</Name>
							<Type>
								<v8:TypeSet>cfg:AnyRef</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номер</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>20</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипЗвонка</Name>
							<Type>
								<v8:Type>cfg:EnumRef.бит_ТипЗвонка</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Успешность</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДлительностьЗвонка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗаписьРазговора</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>1024</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводДата</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВыводДлительностьЗвонка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>10</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</DataProcessor>
</MetaDataObject>

Catalogs/ДолговыеОбязательства.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.13">
	<Catalog>
		<Properties>
			<Name>ДолговыеОбязательства</Name>
			<Comment>Трейд Софт</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВалютаДоговора</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТипДолговогоОбязательства</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ТипыДолговыхОбязательств</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Должник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Кредитор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Услуга</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорКонтрагента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаСоздания</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДоговор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецДолжник</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКонтрагент</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецКредитор</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВладелецУслуга</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1024</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодДО</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗапретАвтообзвона</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеконтактныеНомера</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеРеквизиты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Свойство</Name>
							<Type>
								<v8:Type>cfg:ChartOfCharacteristicTypesRef.ДополнительныеРеквизитыИСведения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:TypeSet>cfg:Characteristic.ДополнительныеРеквизитыИСведения</v8:TypeSet>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Контрагенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидКонтрагента</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ВидыКонтрагентов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>Услуги</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Значение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УслугиПоДоговору</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

DataProcessors/бит_Битфон/Forms/ОбработкаВызова/Ext/Form/Module.bsl
&НаКлиенте
Процедура ПринятьВызов(Команда)
	Закрыть("принять");
КонецПроцедуры

&НаКлиенте
Процедура ОтклонитьВызов(Команда) Экспорт
	Закрыть("отклонить");
КонецПроцедуры

&НаСервере
Процедура ОткрытьКарточкуКлиентаНаСервере()
	ЭтаФорма.ДолговоеОбязательство = Справочники.ДолговыеОбязательства.НайтиПоРеквизиту("Должник", Абонент);
	ЭтаФорма.Кредитор = ЭтаФорма.ДолговоеОбязательство.Кредитор;
КонецПроцедуры

&НаКлиенте
Процедура ОткрытьКарточкуКлиента(Команда)
	//Если КонтрагентНайден Тогда
	//	Если ТипЗнч(Абонент) = Тип("Строка") Тогда
	//		бит_ТелефонияКлиентПереопределяемый.ПоказПредупреждение(Абонент);
	//	Иначе
	//		бит_ТелефонияКлиентПереопределяемый.ОткрытьКарточкуКлиента(Абонент);
	//	КонецЕсли;
	//Иначе
	//	бит_ТелефонияКлиентПереопределяемый.ПоказПредупреждение("Номер неизвестен");
	//КонецЕсли;
	
	// Открыть ДО вместо контрагента
	ОткрытьКарточкуКлиентаНаСервере();
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Истина Тогда
		ОткрытьЗначение(ЭтаФорма.ДолговоеОбязательство)
	Иначе
		Предупреждение("Не удалось найти договор",,"БИТ.Phone");
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	//
	Если бит_ТелефонияКлиентПереопределяемый.ПроверкаНовыйИнтерфейсТакси() Тогда
		Элементы.ПринятьВызов.Высота = 0;
		Элементы.ОтклонитьВызов.Высота = 0;
		Элементы.ОткрытьКарточкуКлиента.Высота = 0;
	КонецЕсли;
	//
	Элементы.Абонент.Видимость = КонтрагентНайден;
	Элементы.КонтактноеЛицо.Видимость = КонтрагентНайден И ЗначениеЗаполнено(КонтактноеЛицо);
	// Скрыть техническую информацию
	// Элементы.НабранныйНомер.Видимость = ЗначениеЗаполнено(НабранныйНомер);
	//
	
	//
	//Если КонтрагентНайден
	//		И (ТипЗнч(Абонент) = Тип("СправочникСсылка." + бит_ТелефонияСерверПереопределяемый.ПолучитьИмяСправочникаКонтрагентов())) Тогда
	//	//
	//	Элементы.ТипАбонента.Видимость = Истина;
	//	Элементы.ГруппаДокументыАбонента.Видимость = Истина;
	//	//
	//	стрТипАбонента = "";
	//	//
	//	Если бит_ТелефонияСерверПереопределяемый.ПроверкаКонтрагентПокупатель(Абонент) Тогда
	//		стрТипАбонента = "Покупатель";
	//	КонецЕсли;
	//	//
	//	Если бит_ТелефонияСерверПереопределяемый.ПроверкаКонтрагентПоставщик(Абонент) Тогда
	//		Если ЗначениеЗаполнено(стрТипАбонента) Тогда
	//			стрТипАбонента = стрТипАбонента + ", Поставщик";
	//		Иначе
	//			стрТипАбонента = "Поставщик";
	//		КонецЕсли;
	//	КонецЕсли;
	//	//
	//	Если НЕ ЗначениеЗаполнено(стрТипАбонента) Тогда
	//		стрТипАбонента = "не задан";
	//	КонецЕсли;
	//	//
	//	ТипАбонента = стрТипАбонента;
	//	//
	//Иначе
	//	Элементы.ТипАбонента.Видимость = Ложь;
	//	Элементы.ГруппаДокументыАбонента.Видимость = Ложь;
	//КонецЕсли;
	
	// Скрыть ДО и кредитора, если не удалось найти договор
	ОткрытьКарточкуКлиентаНаСервере();
	Если ЗначениеЗаполнено(ЭтаФорма.ДолговоеОбязательство) = Ложь И ЗначениеЗаполнено(ЭтаФорма.Кредитор) = Ложь Тогда
		ЭтаФорма.Элементы.Абонент.Видимость = Истина;
		ЭтаФорма.Абонент = "Неопознанный";
		ЭтаФорма.Элементы.ДолговоеОбязательство.Видимость = Ложь;
		ЭтаФорма.Элементы.Кредитор.Видимость = Ложь;
	КонецЕсли;		
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПродажНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьДокументыПродаж(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ДокументыПоступленияНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьДокументыПоступления(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПокупателяНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьЗаказыПокупателя(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаказыПоставщикуНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьЗаказыПоставщику(Абонент);
КонецПроцедуры

&НаКлиенте
Процедура СчетаНаОплатуПокупателяНажатие(Элемент)
	бит_ТелефонияКлиентПереопределяемый.ОткрытьСчетаНаОплатуПокупателя(Абонент);
КонецПроцедуры
